blog/2021/lc-167-two-sum-ii-input-array-is-sorted.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 11:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC167. 两数之和 II - 输入有序数组</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC167. 两数之和 II - 输入有序数组</h1>
</header><p>
今天思考 LeetCode 题目：两数之和-输入有序数组<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-org374ae23" class="outline-2">
<h2 id="org374ae23">题目描述</h2>
<div class="outline-text-2" id="text-org374ae23">
<p>
给定一个已按照「非递减」顺序排列的整数数组 <code>numbers</code> ，从数组中找出两个数满足相加之和等于目标数 <code>target</code> 。
</p>

<p>
函数应该以长度为 <code>2</code> 的整数数组的形式返回这两个数的下标值。 <code>numbers</code> 的下标 <b>从 1 开始计数</b> ，所以答案数组应当满足 <code>1 &lt;= answer[0] &lt; answer[1] &lt;= numbers.length</code> 。
</p>

<p>
可假设每个输入只对应唯一的答案，而且不可以重复使用相同的元素。
</p>
</div>
</div>

<div id="outline-container-org728ea49" class="outline-2">
<h2 id="org728ea49">题解</h2>
<div class="outline-text-2" id="text-org728ea49">
</div>
<div id="outline-container-org6651223" class="outline-3">
<h3 id="org6651223">一<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h3>
<div class="outline-text-3" id="text-org6651223">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {number[]} numbers</span>
<span style="color: #7c7565;"> * @param {number} target</span>
<span style="color: #7c7565;"> * @return {number[]}</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">twoSum</span> = <span style="color: #91a0b3;">function</span> (<span style="color: #aaca86;">numbers</span>, <span style="color: #aaca86;">target</span>) {
  <span style="color: #91a0b3;">let</span> [<span style="color: #aaca86;">left</span>, <span style="color: #aaca86;">right</span>] = [0, numbers.length - 1];
  <span style="color: #706565;">// </span><span style="color: #857575;">&#23450;&#20041;&#24038;&#21491;&#21452;&#25351;&#38024;</span>
  <span style="color: #91a0b3;">while</span> (left &lt; right) {
    <span style="color: #91a0b3;">if</span> (numbers[left] + numbers[right] &gt; target) {
      right--; <span style="color: #706565;">// </span><span style="color: #857575;">&#22826;&#22823;&#65292;&#21491;&#25351;&#38024;&#24038;&#31227;</span>
    } <span style="color: #91a0b3;">else</span> <span style="color: #91a0b3;">if</span> (numbers[left] + numbers[right] &lt; target) {
      left++; <span style="color: #706565;">// </span><span style="color: #857575;">&#22826;&#23567;&#65292;&#24038;&#25351;&#38024;&#21491;&#31227;</span>
    } <span style="color: #91a0b3;">else</span> {
      <span style="color: #91a0b3;">return</span> [left + 1, right + 1]; <span style="color: #706565;">// </span><span style="color: #857575;">&#21508;&#33258;+1 &#36820;&#22238;</span>
    }
  }
};
</pre>
</div>

<p>
使用双指针法
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/two-sum-ii-input-array-is-sorted/">https://leetcode-cn.com/problems/two-sum-ii-input-array-is-sorted/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/two-sum-ii-input-array-is-sorted/solution/fan-shi-you-xu-shu-zu-jie-ti-tao-lu-yong-qgoq/">https://leetcode-cn.com/problems/two-sum-ii-input-array-is-sorted/solution/fan-shi-you-xu-shu-zu-jie-ti-tao-lu-yong-qgoq/</a>
</p></div></div>


</div>
</div></div>
</body>
</html>